# duplicated(), drop_duplicates(),groupby(),sum(),mean(),min(),max(),sort_values(),to_datetime(),process.extract()

In [14]:
import pandas as pd
import numpy as np
data = {'ID': [1, 2, 2, 3, 4, 4],
        'Name': ['Alice', 'Bob', 'Bob', 'Charlie', 'David', 'David'],
        'Age': [25, 30, 30, 35, 40, 40]}

df = pd.DataFrame(data)
df

   ID     Name  Age
0   1    Alice   25
1   2      Bob   30
2   2      Bob   30
3   3  Charlie   35
4   4    David   40
5   4    David   40

In [15]:
df.duplicated()

0    False
1    False
2     True
3    False
4    False
5     True
dtype: bool

In [16]:
duplicates = df.duplicated()
df[duplicates]

   ID   Name  Age
2   2    Bob   30
5   4  David   40

#  Grabbing unique rows

In [17]:
unique=df.drop_duplicates()
unique

   ID     Name  Age
0   1    Alice   25
1   2      Bob   30
3   3  Charlie   35
4   4    David   40

In [23]:
# Handling Duplicate Data in Pandas
# Handling duplicate rows in Pandas DataFrames is an essential data-cleaning step 
# to ensure data integrity and accuracy.

import pandas as pd

# Sample dataset with duplicate values
data = {
    'CustomerID': [101, 102, 103, 101, 104, 102],
    'Name': ['Alice', 'Bob', 'Charlie', 'Alice', 'David', 'Bob'],
    'Purchase': [250, 300, 150, 250, 400, 300]
}

df = pd.DataFrame(data)

# ---- Locating Duplicate Rows ----
# Checking for duplicate rows
duplicate_rows = df[df.duplicated()]
print("Duplicate Rows:\n", duplicate_rows)

# ---- Grabbing Unique Rows ----
# Getting unique rows by dropping duplicates
unique_rows = df.drop_duplicates()
print("Unique Rows:\n", unique_rows)

# ---- Removing Rows completely which are present in duplicate manner ----
# Removing all duplicate rows
df_no_duplicates = df.drop_duplicates(keep=False)
print("Data without duplicates:\n", df_no_duplicates)

# ---- Suppose Duplicate transactions are fraudulent transactions ----
# In cases where duplicate transactions indicate fraud, marking them
df['is_duplicated'] = df.duplicated(keep=False)
print("Marked duplicate transactions:\n", df)

# ---- Duplicate based on Specific Subset ----
# Removing duplicates based on a specific column (CustomerID)
df_unique_customers = df.drop_duplicates(subset=['CustomerID'])
print("Unique customers:\n", df_unique_customers)

# ---- Marking Duplicate Rows ----
# Flagging duplicate rows for review
df['Duplicate_Flag'] = df.duplicated()
print("Data with duplicate flags:\n", df)

# ---- Handling Duplicates with Aggregation ----
# When duplicate rows contain different values, we can aggregate instead of removing them
data_agg = {
    'CustomerID': [101, 102, 103, 101, 104, 102],
    'Amount': [250, 300, 150, 200, 400, 350]
}

df_agg = pd.DataFrame(data_agg)

# Aggregating duplicate records using sum
df_grouped = df_agg.groupby('CustomerID').sum()
print("Aggregated Data:\n", df_grouped)

# ---- Handling Duplicates with Different Timestamps ----
# Keeping only the latest record per CustomerID
data_time = {
    'CustomerID': [101, 102, 103, 101, 104, 102],
    'Purchase': [250, 300, 150, 200, 400, 350],
    'Timestamp': ['2023-03-01', '2023-03-02', '2023-03-01', '2023-03-03', '2023-03-01', '2023-03-04']
}

df_time = pd.DataFrame(data_time)

# Sorting and keeping the latest transaction per customer
df_time['Timestamp'] = pd.to_datetime(df_time['Timestamp'])
df_latest = df_time.sort_values(by=['CustomerID', 'Timestamp']).drop_duplicates(subset='CustomerID', keep='last')
print("Latest Transactions:\n", df_latest)

Duplicate Rows:
    CustomerID   Name  Purchase
3         101  Alice       250
5         102    Bob       300
Unique Rows:
    CustomerID     Name  Purchase
0         101    Alice       250
1         102      Bob       300
2         103  Charlie       150
4         104    David       400
Data without duplicates:
    CustomerID     Name  Purchase
2         103  Charlie       150
4         104    David       400
Marked duplicate transactions:
    CustomerID     Name  Purchase  is_duplicated
0         101    Alice       250           True
1         102      Bob       300           True
2         103  Charlie       150          False
3         101    Alice       250           True
4         104    David       400          False
5         102      Bob       300           True
Unique customers:
    CustomerID     Name  Purchase  is_duplicated
0         101    Alice       250           True
1         102      Bob       300           True
2         103  Charlie       150          False
4         104    David       400          False
Data with duplicate flags:
    CustomerID     Name  Purchase  is_duplicated  Duplicate_Flag
0         101    Alice       250           True           False
1         102      Bob       300           True           False
2         103  Charlie       150          False           False
3         101    Alice       250           True            True
4         104    David       400          False           False
5         102      Bob       300           True            True
Aggregated Data:
             Amount
CustomerID
101            450
102            650
103            150
104            400
Latest Transactions:
    CustomerID  Purchase  Timestamp
3         101       200 2023-03-03
5         102       350 2023-03-04
2         103       150 2023-03-01
4         104       400 2023-03-01

In [22]:
# ---- Duplicate with Close Match ----
# Handling duplicates with slight differences (close matches)

from thefuzz import process,fuzz

# Example dataset with close matches
data = ['apple', 'appl', 'apples', 'banana', 'bananaa']

# Query for comparison
query = 'apple'

# Finding close matches with a similarity ratio
closest_matches = process.extract(query, data, limit=3)

print("Closest Matches:\n", closest_matches)

Closest Matches:
 [('apple', 100), ('apples', 91), ('appl', 89)]